app/controllers/blogs_controller.rb

    def showBlog
        data = Blog.all
---
SELECT "blogs".* FROM "blogs"

    def addBlog
        data = Blog.new({
            "blog_title"=>params[:blog_title],
            "blog_descp"=>params[:blog_descp]
        })
        data.save
---
INSERT INTO "blogs" ("blog_title", "blog_descp", "created_at", "updated_at") VALUES (?, ?, ?, ?)